---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetRebarId
source: html/ef027bb1-3944-1abd-78ef-02125ec36a9e.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetRebarId Method

Get the id of the Rebar element currently being calculated.

## Syntax (C#)
```csharp
public ElementId GetRebarId()
```

## Returns
returns the id of the Rebar element currently being calculated